{
  "title": "Wobani",
  "universe": "star_wars",
  "cached_at": "2025-10-10T22:58:25.755097",
  "content": {
    "name": "Wobani",
    "description": "Wobani\n\n\nAstrographical information\n\nRegion\nMid Rim Territories\n\n\nSector\nBryx sector\n\n\nSystem\nWobani system\n\n\nGrid square\nR-8\n\n\n\nPhysical information\n\nAtmosphere\nBreathable\n\n\nClimate\nTemperate\n\n\nTerrain\nHillsMud plainsRock formations\n\n\nPoints of interest\nImperial Detention Center & Labor Camp LEG-817Imperial headquartersWobani Penitentiary\n\n\n\nSocietal information\n\nAffiliation\nGalactic EmpireNew Republic\n\n\n[Source]",
    "biography": "When Princess Leia Organa was sixteen, she went on a humanitarian mission to Wobani as part of her Challenge of the Heart, with the intention of providing the people there with supplies. Upon her arrival, she realized how truly terrible the natives were being treated, and decided to take as many refugees back to Alderaan as she could. She was able to trick the Imperial officer, Major Tedam, in charge of Wobani, by hiring several Wobani citizens to come work aboard her ship, rescuing 100 refugees in the process. These refugees were then taken to Alderaan, where they could choose to stay or live on other planets, all at the expense of the royal family. Unbeknownst to the princess at the time however, in doing this she had undermined negotiations her father, Bail Organa, Senator Mon Mothma and some of his other allies in the Imperial Senate had been in for resettlement of the Wobani population for months. Due to the princess's actions the deal could no longer happen as everyone with authority over Wobani was embarrassed, angry and unwilling to bargain.\nWobani continued to deteriorate under Imperial rule until the Empire elected to only use the planet as a site for manual labor and prisoners. Shortly before stealing the plans for the Death Star, Jyn Erso was held in an Imperial labor camp on Wobani for six months until being broken out by Extraction Team Bravo of the Rebel Alliance. In 3 ABY, a transport shuttle traveled from Wobani to the Mid Rim planet Kijimi where it requested priority landing clearance.",
    "abilities": [],
    "image_url": "https://static.wikia.nocookie.net/starwars/images/c/c2/Wobani.png/revision/latest/scale-to-width-down/500?cb=20180130034302",
    "info": {
      "region": "Mid Rim Territories, ",
      "sector": "Bryx sector, ",
      "system": "Wobani system, ",
      "grid_square": "R-8, ",
      "atmosphere": "Breathable, ",
      "climate": "Temperate, ",
      "terrain": ", , ",
      "points_of_interest": "Imperial Detention Center & Labor Camp LEG-817, , Imperial headquarters, , Wobani Penitentiary, ",
      "affiliation": "Galactic Empire, , New Republic, "
    },
    "affiliations": [
      "Galactic Empire",
      "New Republic"
    ]
  }
}