{
  "title": "Im",
  "universe": "star_wars",
  "cached_at": "2025-10-10T23:01:34.665166",
  "content": {
    "name": "Imperial military uniforms",
    "description": "Imperial military uniform\n\n\nProduction information\n\nType\nMilitary uniform\n\n\nDate created\nIn or before 17 BBY\n\n\nOwners\nImperial officers\n\n\n\nPhysical and technical specifications\n\nColor\nFor Imperial officersGray-green/Olive-greenBlackWhiteGrayGray-blueFor Imperial techniciansBlackLight-gray\n\n\nMaterial(s)\nGaberwool\n\n\n\nUsage and history\n\nAffiliation\nGalactic EmpireImperial MilitaryImperial RemnantsAdelhard coalitionUbrik Adelhard's Imperial remnantKenner Loring's factionVisler Korda's factionQueluha",
    "biography": "At the conclusion of the Clone Wars, Supreme Chancellor Sheev Palpatine abolished the democratic Republic he presided over, reorganizing it into a First Galactic Empire with him as absolute ruler. As the massive Grand Army of the Republic was progressively transformed into the Imperial Military, the uniform originally created for the Republic officers remained in use during the first couple of years of Emperor Palpatine's reign. However, in or around the year 18 BBY, the scientist Galen Walton Erso and Orson Callan Krennic wore the new uniform when they were in meeting on Coruscant, the Empire's capital world.\nHowever, the uniform still was not in widespread use by as late as 14 BBY. Moff Wilhuff Tarkin, a decorated Imperial governor from Eriadu, made final adjustments to his personal uniform this year. When Grand Vizier Mas Amedda summoned Tarkin to Imperial Center, Admiral Nils Tenant commented his surprise at seeing Tarkin wearing the new uniform, having not seen it before.\nImperial uniforms would continue to be used over the course of the Galactic Civil War, which would end with the formation of the New Republic and destruction of the Empire. However, Imperial uniforms continued to be used by those who clung to Imperial ideology as officers of the Imperial Remnants, including officers of the Morak Imperial remnants and those remnants united by the Shadow Council. Additionally, the defected Imperial captain Imanuel Doza kept his old Imperial uniform in his possession.",
    "abilities": [],
    "image_url": "https://static.wikia.nocookie.net/starwars/images/d/d6/AdmiralOzzel-bodyshot.png/revision/latest/scale-to-width-down/232?cb=20231007053653",
    "info": {
      "date_created": "17 BBY, , ",
      "owners": "Imperial officers, ",
      "color": "Gray-green, , , , , , , ",
      "materials": "Gaberwool, ",
      "affiliation": "Galactic Empire, , Imperial Military, Imperial Remnants, , Adelhard coalition, , Ubrik Adelhard's Imperial remnant, , Kenner Loring's faction, , Visler Korda's faction, , Queluhan Nebula Imperial remnant, , Gideon's Imperial remnant, , Morak Imperial remnant, , Thrawn's forces, "
    },
    "affiliations": [
      "Adelhard coalition",
      "Galactic Empire",
      "Gideon's Imperial remnant",
      "Imperial Military",
      "Imperial Remnants",
      "Kenner Loring's faction",
      "Morak Imperial remnant",
      "Queluhan Nebula Imperial remnant",
      "Thrawn's forces",
      "Ubrik Adelhard's Imperial remnant"
    ]
  }
}